#pragma once

#include "../CGALib/gameinterface.h"
#include "../CGALib/packdata.h"

#include <list>
#include <shellapi.h>

struct IDirectDraw;
struct IDirectDrawSurface;

namespace CGA
{
#pragma pack(4)

	class CXorValue
	{
	public:
		CXorValue(int value);
		int decode();
		void set(int value);
	public:
		int unknown;
		int key1;
		int key2;
		unsigned char refcount;
	};

	typedef struct ui_anim_s
	{
		int a1;
		int a2;
		int ymove;
		int flags;
		int ypos;
		int counter;
		int state;
		int type;
	}ui_anim_t;

	typedef struct btn_rect_s
	{
		int left;
		int top;
		int width;
		int height;
		int image_idle;
		int image_mouseover;
		int image_unk;
	}btn_rect_t;

	static_assert(sizeof(btn_rect_t) == 28, "Size check");

	//item base ??? D04820->D04E64(644)
	//item base CC70B0->CC76FC (64c)
	//sizex=0x64C
	typedef struct item_s
	{
		short valid;
		short unk;
		int unk2;
		int count;
		int item_id;
		char name[1596];
	}item_t;

	static_assert(sizeof(item_t) == 0x64C, "Size check");

	//item base 1212DCC, include equipments
	//size=1628 (65C)
	//[0] = hat
	//[1] = cloth
	//[2] = right hand
	//[3] = left hand
	//[4] = foot
	//[5] = decoration 1
	//[6] = decoration 2
	//[7] = crystal
	typedef struct item_info_s
	{
		short valid;
		char name[46];
		char attr[8][96];
		char info[8][96];
		int flags;//2=right clickable
		int unk;
		int image_id;
		int level;
		int item_id;
		int count;
		int type;
		short double_clickable;
		short unk2;
		short unk3;
		short assess_flags;
		int assessed;//已鉴定
		int unk6;
	}item_info_t;

	static_assert(sizeof(item_info_t) == 0x65C, "Size check");

	typedef struct bank_item_info_s
	{
		short valid;
		short padding;
		int image_id;
		int count;
		char name[29];
		char attr[8][96];
		char info[8][96];
		char padding2[19];
		int flags;//2=right clickable
		int unk;
	}bank_item_info_t;
	
	static_assert(sizeof(bank_item_info_t) == 0x644, "Size check");

	typedef struct bank_pet_info_s
	{
		short valid; //0x0000 
		short race; //0x0002 
		int imageid; //0x0004 
		int level; //0x0008 
		int padding1; //0x000C 
		int maxhp; //0x0010 
		int padding2; //0x0014 
		int maxmp; //0x0018 
		int points_endurance; //0x001C 
		int points_strength; //0x0020 
		int points_defense; //0x0024 
		int points_agility; //0x0028 
		int points_magical; //0x002C 
		int value_attack; //0x0030 
		int value_defensive; //0x0034 
		int value_agility; //0x0038 
		int value_spirit; //0x003C 
		int value_recovery; //0x0040 
		int value_loyality; //0x0044 
		int element_earth; //0x0048 
		int element_water; //0x004C 
		int element_fire; //0x0050 
		int element_wind; //0x0054 
		int skill_slots; //0x0058 
		int padding3; //0x005C 
		int padding4; //0x0060 
		char skills[9][0x8C]; //0x105CE0C 
		char skill_last[0x84];
		char nickname[17]; //0x105CE0C 
		char originalname[19]; //0x105CE0C 
	}bank_pet_info_t;

	static_assert(sizeof(bank_pet_info_t) == 0x5F8, "Size check");

	typedef struct npcdlg_item_info_s
	{
		char valid;//CD3198
		char name[29];//CD3199
		char attr[1538];//CD31B6
		int image_id;//CD37B8
		int cost;//CD37BC
		int selected;//CD37C0
		int itempos;//CD37C4
		int unk;
		int unk2;//init to 1
		int unk3;
		char unk4;
		char padding[3];
		int unk5;
		char info[20];//CD37DC
	}npcdlg_item_info_t;

	static_assert(sizeof(npcdlg_item_info_t) == 0x658, "Size check");

	//12AB3E0
	typedef struct player_pers_desc_s
	{
		int sellIcon;
		int sellUnk;
		char sellString[256];
		int buyIcon;
		int buyUnk;
		char buyString[256];
		int wantIcon;
		int wantUnk;
		char wantString[256];
		char descString[256];
		char unk[0x410];
	}player_pers_desc_t;

	static_assert(sizeof(player_pers_desc_t) == 0x828, "Size check");

#define PLAYER_ENABLE_FLAGS_PK (1<<2)
#define PLAYER_ENABLE_FLAGS_TEAMCHAT (1<<3)
#define PLAYER_ENABLE_FLAGS_JOINTEAM (1<<0)
#define PLAYER_ENABLE_FLAGS_CARD (1<<4)
#define PLAYER_ENABLE_FLAGS_TRADE (1<<5)
#define PLAYER_ENABLE_FLAGS_FAMILY (1<<6)

#define PET_STATE_READY 1
#define PET_STATE_BATTLE 2
#define PET_STATE_REST 3
#define PET_STATE_WALK 16

	typedef struct playerbase_s
	{
		short race;	//+0
		short padding;//+2
		int level;	//+4
		int unk;	//+8
		int punchclock;//+12
		int using_punchclock;	//+16
		int tickcount;	//+20
		CXorValue hp;//+24
		CXorValue maxhp;//+40
		CXorValue mp;//+56
		CXorValue maxmp;//+72
		CXorValue xp;//+88
		CXorValue maxxp;//+104
		int points_endurance;//+120
		int points_strength;//+124
		int points_defense;//+128
		int points_agility;//+132
		int points_magical;//+136		
		int manu_endurance;//+140
		int manu_skillful;//+144
		int manu_intelligence;//+148
		int value_attack; //+152
		int value_defensive;//+156
		int value_agility;//+160
		int value_spirit;//+164
		int value_recovery;//+168
		int value_charisma;//+172
		int unk3;//+176
		int resist_poison;//+180
		int resist_sleep;//+184
		int resist_medusa;//+188
		int resist_drunk;//+192
		int resist_chaos;//+196
		int resist_forget;//+200
		int fix_critical;//+204
		int fix_strikeback;//+208
		int fix_accurancy;//+212
		int fix_dodge;//+216
		int element_earth;//+220
		int element_water;//+224
		int element_fire;//+228
		int element_wind;//+232
		int health;//+236
		int souls;//+240
		int gold;//+244
		int special_nick;//+248 //使用第几个称号
		int score;//+252
		char name[17];//+256
		char player_nick[17];//+273
		char what[33];//+290
		char what2[33];//+323
		int skill_maxrows;//+356
		int move_speed;//+360 int unk
		int unk4;//+364
		int image_id;//+368
		int avatar_id;//+372
		int unitid;//+376
		int direction;//+380
		short unk7;//+384
		short unk8;//+386
		char unk9;//+388
		char padding2;
		short unk10;//+390
		int collect_type;//+392
		int enable_flags;//+396
		int unk11;//+400
		int unk12;//+404
		int battle_position;//+408
		item_info_t iteminfos[40];//+412 = itembase
	}playerbase_t;

	static_assert(offsetof(playerbase_t, iteminfos) == 412, "Size check");

	//size = 148
	typedef struct skill_sub_s
	{
		char name[25];//0
		char info[99];//25
		int cost;//124
		int unk1;//128
		int flags;//132
		int unk3;//136
		int available;//140
		int level;//144
	}skill_sub_t;

	static_assert(sizeof(skill_sub_t) == 148, "Size check");

	typedef struct skill_craft_mat_s
	{
		int itemid;//-1 if none
		int count;//-1 if none
		char name[32];
	}skill_craft_mat_t;

	static_assert(sizeof(skill_craft_mat_t) == 40, "Size check");

	typedef struct skill_craft_s
	{
		int subskill_id;
		int cost;
		int level;
		int available;
		int itemid;
		char name[29];
		char info[59];
		skill_craft_mat_t mats[5];
	}skill_craft_t;

	static_assert(sizeof(skill_craft_t) == 308, "Size check");

	//size=0x49FC
	typedef struct skill_s
	{
		char name[25];
		char slotsize;
		char padding[2];
		int level;
		int maxlevel;
		int xp;
		int maxxp;
		int type;//1=制造 2=鉴定 3=治疗 4=采集
		int skill_id;//255 =???, 225=伐木
		int unk3;
		int pos;
		//offset=60
		skill_sub_t sub[11];
		;//offset=1688
		skill_craft_t craft[50];
		char padding2[1852];
	}skill_t;

	static_assert(sizeof(skill_t) == 0x49FC, "Size check");

	//size=140
	typedef struct pet_skill_s
	{
